balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ06GS001.PIC
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="------n---------" edc:cname="IEC3" edc:desc="" edc:impl="0x602" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0---------" edc:name="IEC3" edc:nzwidth="0x10" edc:por="------0---------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="9"/>
              <edc:SFRFieldDef edc:cname="PSEMIE" edc:desc="" edc:mask="0x1" edc:name="PSEMIE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="-n-------------n" edc:cname="IEC5" edc:desc="" edc:impl="0x1" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-0-------------0" edc:name="IEC5" edc:nzwidth="0x10" edc:por="-0-------------0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="JTAGIE" edc:desc="" edc:mask="0x1" edc:name="JTAGIE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="13"/>
              <edc:SFRFieldDef edc:cname="PWM1IE" edc:desc="" edc:mask="0x1" edc:name="PWM1IE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn------n-----n-" edc:cname="IEC6" edc:desc="" edc:impl="0x80" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00------0-----0-" edc:name="IEC6" edc:nzwidth="0x10" edc:por="00------0-----0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="PWM4IE" edc:desc="" edc:mask="0x1" edc:name="PWM4IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="5"/>
              <edc:SFRFieldDef edc:cname="AC2IE" edc:desc="" edc:mask="0x1" edc:name="AC2IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="ADCP0IE" edc:desc="" edc:mask="0x1" edc:name="ADCP0IE" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADCP1IE" edc:desc="" edc:mask="0x1" edc:name="ADCP1IE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-----------n--n-" edc:cname="IEC7" edc:desc="" edc:impl="0x20db" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-----------0--0-" edc:name="IEC7" edc:nzwidth="0x10" edc:por="-----------0--0-">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="ADCP3IE" edc:desc="" edc:mask="0x1" edc:name="ADCP3IE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="ADCP6IE" edc:desc="" edc:mask="0x1" edc:name="ADCP6IE" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nnn---------nnn" edc:cname="IPC0" edc:desc="" edc:impl="0x7007" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-100---------100" edc:name="IPC0" edc:nzwidth="0x10" edc:por="-100---------100">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT0IP" edc:desc="" edc:mask="0x7" edc:name="INT0IP" edc:nzwidth="0x3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="3"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1IP" edc:desc="" edc:mask="0x7" edc:name="T1IP" edc:nzwidth="0x3"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT0IP0" edc:desc="" edc:mask="0x1" edc:name="INT0IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT0IP1" edc:desc="" edc:mask="0x1" edc:name="INT0IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT0IP2" edc:desc="" edc:mask="0x1" edc:name="INT0IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="IC1IP0" edc:desc="" edc:mask="0x1" edc:name="IC1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1IP1" edc:desc="" edc:mask="0x1" edc:name="IC1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IC1IP2" edc:desc="" edc:mask="0x1" edc:name="IC1IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="OC1IP0" edc:desc="" edc:mask="0x1" edc:name="OC1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC1IP1" edc:desc="" edc:mask="0x1" edc:name="OC1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OC1IP2" edc:desc="" edc:mask="0x1" edc:name="OC1IP2" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="T1IP0" edc:desc="" edc:mask="0x1" edc:name="T1IP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1IP1" edc:desc="" edc:mask="0x1" edc:name="T1IP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1IP2" edc:desc="" edc:mask="0x1" edc:name="T1IP2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
