balazsgrill/modembed/res/Devices/dsPIC33/DSPIC33FJ06GS001.PIC
        <edc:SFRDef edc:access="nnnnnnnnnnnnn---" edc:cname="PWMCAP4" edc:desc="" edc:impl="0xfff8" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="PWMCAP4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="PWMCAP4" edc:desc="" edc:islanghidden="true" edc:mask="0x1fff" edc:name="PWMCAP4" edc:nzwidth="0xd"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnn----nnnnnn" edc:cname="LEBCON4" edc:desc="" edc:impl="0xffc3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000000000---" edc:name="LEBCON4" edc:nzwidth="0x10" edc:por="0000000000000---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="LEB" edc:desc="" edc:mask="0x7f" edc:name="LEB" edc:nzwidth="7"/>
              <edc:SFRFieldDef edc:cname="CLLEBEN" edc:desc="" edc:mask="0x1" edc:name="CLLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FLTLEBEN" edc:desc="" edc:mask="0x1" edc:name="FLTLEBEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLF" edc:desc="" edc:mask="0x1" edc:name="PLF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PLR" edc:desc="" edc:mask="0x1" edc:name="PLR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHF" edc:desc="" edc:mask="0x1" edc:name="PHF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="PHR" edc:desc="" edc:mask="0x1" edc:name="PHR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="LEB0" edc:desc="" edc:mask="0x1" edc:name="LEB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB1" edc:desc="" edc:mask="0x1" edc:name="LEB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB2" edc:desc="" edc:mask="0x1" edc:name="LEB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB3" edc:desc="" edc:mask="0x1" edc:name="LEB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB4" edc:desc="" edc:mask="0x1" edc:name="LEB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB5" edc:desc="" edc:mask="0x1" edc:name="LEB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="LEB6" edc:desc="" edc:mask="0x1" edc:name="LEB6" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="nn--------nnnnnn" edc:cname="AUXCON4" edc:desc="" edc:impl="0xc03f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00--------000000" edc:name="AUXCON4" edc:nzwidth="16" edc:por="00--------000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CHOPLEN" edc:desc="" edc:mask="0x1" edc:name="CHOPLEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPHEN" edc:desc="" edc:mask="0x1" edc:name="CHOPHEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CHOPSEL" edc:desc="" edc:mask="0xf" edc:name="CHOPSEL" edc:nzwidth="4"/>
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="HRDDIS" edc:desc="" edc:mask="0x1" edc:name="HRDDIS" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HRPDIS" edc:desc="" edc:mask="0x1" edc:name="HRPDIS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="160"/>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="CMPCON1" edc:desc="" edc:impl="0xbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="CMPCON1" edc:nzwidth="16" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RANGE" edc:desc="" edc:mask="0x1" edc:name="RANGE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPPOL" edc:desc="" edc:mask="0x1" edc:name="CMPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HGAIN" edc:desc="" edc:mask="0x1" edc:name="HGAIN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPSTAT" edc:desc="" edc:mask="0x1" edc:name="CMPSTAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EXTREF" edc:desc="" edc:mask="0x1" edc:name="EXTREF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INSEL" edc:desc="" edc:mask="0x3" edc:name="INSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FCLKSEL" edc:desc="" edc:mask="0x1" edc:name="FCLKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTREN" edc:desc="" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CMPSIDL" edc:desc="" edc:mask="0x1" edc:name="CMPSIDL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPON" edc:desc="" edc:mask="0x1" edc:name="CMPON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="CMPDAC1" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="CMPDAC1" edc:nzwidth="16" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMREF" edc:desc="" edc:mask="0x3ff" edc:name="CMREF" edc:nzwidth="10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="n-nnnnnnnnnnnnnn" edc:cname="CMPCON2" edc:desc="" edc:impl="0xbfff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0-00000000000000" edc:name="CMPCON2" edc:nzwidth="16" edc:por="0-00000000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RANGE" edc:desc="" edc:mask="0x1" edc:name="RANGE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPPOL" edc:desc="" edc:mask="0x1" edc:name="CMPPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HGAIN" edc:desc="" edc:mask="0x1" edc:name="HGAIN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CMPSTAT" edc:desc="" edc:mask="0x1" edc:name="CMPSTAT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSPOL" edc:desc="" edc:mask="0x1" edc:name="HYSPOL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="EXTREF" edc:desc="" edc:mask="0x1" edc:name="EXTREF" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INSEL" edc:desc="" edc:mask="0x3" edc:name="INSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="DACOE" edc:desc="" edc:mask="0x1" edc:name="DACOE" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FCLKSEL" edc:desc="" edc:mask="0x1" edc:name="FCLKSEL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLTREN" edc:desc="" edc:mask="0x1" edc:name="FLTREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="HYSSEL" edc:desc="" edc:mask="0x3" edc:name="HYSSEL" edc:nzwidth="2"/>
              <edc:SFRFieldDef edc:cname="CMPSIDL" edc:desc="" edc:mask="0x1" edc:name="CMPSIDL" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CMPON" edc:desc="" edc:mask="0x1" edc:name="CMPON" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nnnnnnnnnn" edc:cname="CMPDAC2" edc:desc="" edc:impl="0x3ff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------0000000000" edc:name="CMPDAC2" edc:nzwidth="16" edc:por="------0000000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="CMREF" edc:desc="" edc:mask="0x3ff" edc:name="CMREF" edc:nzwidth="10"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="312"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR0" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR0" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R" edc:desc="" edc:mask="0x3f" edc:name="INT1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="INT1R0" edc:desc="" edc:mask="0x1" edc:name="INT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R1" edc:desc="" edc:mask="0x1" edc:name="INT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R2" edc:desc="" edc:mask="0x1" edc:name="INT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R3" edc:desc="" edc:mask="0x1" edc:name="INT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R4" edc:desc="" edc:mask="0x1" edc:name="INT1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT1R5" edc:desc="" edc:mask="0x1" edc:name="INT1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR1" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR1" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="INT2R" edc:desc="" edc:mask="0x3f" edc:name="INT2R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="INT2R0" edc:desc="" edc:mask="0x1" edc:name="INT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R1" edc:desc="" edc:mask="0x1" edc:name="INT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R2" edc:desc="" edc:mask="0x1" edc:name="INT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R3" edc:desc="" edc:mask="0x1" edc:name="INT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R4" edc:desc="" edc:mask="0x1" edc:name="INT2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="INT2R5" edc:desc="" edc:mask="0x1" edc:name="INT2R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR2" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR2" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="T1CKR" edc:desc="" edc:mask="0x3f" edc:name="T1CKR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="T1CKR0" edc:desc="" edc:mask="0x1" edc:name="T1CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR1" edc:desc="" edc:mask="0x1" edc:name="T1CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR2" edc:desc="" edc:mask="0x1" edc:name="T1CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR3" edc:desc="" edc:mask="0x1" edc:name="T1CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR4" edc:desc="" edc:mask="0x1" edc:name="T1CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T1CKR5" edc:desc="" edc:mask="0x1" edc:name="T1CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="----------nnnnnn" edc:cname="RPINR3" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------111111" edc:name="RPINR3" edc:nzwidth="0x10" edc:por="----------111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="T2CKR" edc:desc="" edc:mask="0x3f" edc:name="T2CKR" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="T2CKR0" edc:desc="" edc:mask="0x1" edc:name="T2CKR0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR1" edc:desc="" edc:mask="0x1" edc:name="T2CKR1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR2" edc:desc="" edc:mask="0x1" edc:name="T2CKR2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR3" edc:desc="" edc:mask="0x1" edc:name="T2CKR3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR4" edc:desc="" edc:mask="0x1" edc:name="T2CKR4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="T2CKR5" edc:desc="" edc:mask="0x1" edc:name="T2CKR5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="50"/>
        <edc:SFRDef edc:access="--nnnnnn--------" edc:cname="RPINR29" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--------" edc:name="RPINR29" edc:nzwidth="0x10" edc:por="--111111--------">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FLT1R" edc:desc="" edc:mask="0x3f" edc:name="FLT1R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="8"/>
              <edc:SFRFieldDef edc:cname="FLT1R0" edc:desc="" edc:mask="0x1" edc:name="FLT1R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R1" edc:desc="" edc:mask="0x1" edc:name="FLT1R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R2" edc:desc="" edc:mask="0x1" edc:name="FLT1R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R3" edc:desc="" edc:mask="0x1" edc:name="FLT1R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R4" edc:desc="" edc:mask="0x1" edc:name="FLT1R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT1R5" edc:desc="" edc:mask="0x1" edc:name="FLT1R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR30" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR30" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT2R" edc:desc="" edc:mask="0x3f" edc:name="FLT2R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT3R" edc:desc="" edc:mask="0x3f" edc:name="FLT3R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT2R0" edc:desc="" edc:mask="0x1" edc:name="FLT2R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R1" edc:desc="" edc:mask="0x1" edc:name="FLT2R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R2" edc:desc="" edc:mask="0x1" edc:name="FLT2R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R3" edc:desc="" edc:mask="0x1" edc:name="FLT2R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R4" edc:desc="" edc:mask="0x1" edc:name="FLT2R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT2R5" edc:desc="" edc:mask="0x1" edc:name="FLT2R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT3R0" edc:desc="" edc:mask="0x1" edc:name="FLT3R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R1" edc:desc="" edc:mask="0x1" edc:name="FLT3R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R2" edc:desc="" edc:mask="0x1" edc:name="FLT3R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R3" edc:desc="" edc:mask="0x1" edc:name="FLT3R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R4" edc:desc="" edc:mask="0x1" edc:name="FLT3R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT3R5" edc:desc="" edc:mask="0x1" edc:name="FLT3R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR31" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR31" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT4R" edc:desc="" edc:mask="0x3f" edc:name="FLT4R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT5R" edc:desc="" edc:mask="0x3f" edc:name="FLT5R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT4R0" edc:desc="" edc:mask="0x1" edc:name="FLT4R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R1" edc:desc="" edc:mask="0x1" edc:name="FLT4R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R2" edc:desc="" edc:mask="0x1" edc:name="FLT4R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R3" edc:desc="" edc:mask="0x1" edc:name="FLT4R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R4" edc:desc="" edc:mask="0x1" edc:name="FLT4R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT4R5" edc:desc="" edc:mask="0x1" edc:name="FLT4R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT5R0" edc:desc="" edc:mask="0x1" edc:name="FLT5R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R1" edc:desc="" edc:mask="0x1" edc:name="FLT5R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R2" edc:desc="" edc:mask="0x1" edc:name="FLT5R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R3" edc:desc="" edc:mask="0x1" edc:name="FLT5R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R4" edc:desc="" edc:mask="0x1" edc:name="FLT5R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT5R5" edc:desc="" edc:mask="0x1" edc:name="FLT5R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="--nnnnnn--nnnnnn" edc:cname="RPINR32" edc:desc="" edc:impl="0x0" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--111111--111111" edc:name="RPINR32" edc:nzwidth="0x10" edc:por="--111111--111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FLT6R" edc:desc="" edc:mask="0x3f" edc:name="FLT6R" edc:nzwidth="0x6"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT7R" edc:desc="" edc:mask="0x3f" edc:name="FLT7R" edc:nzwidth="0x6"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FLT6R0" edc:desc="" edc:mask="0x1" edc:name="FLT6R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R1" edc:desc="" edc:mask="0x1" edc:name="FLT6R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R2" edc:desc="" edc:mask="0x1" edc:name="FLT6R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R3" edc:desc="" edc:mask="0x1" edc:name="FLT6R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R4" edc:desc="" edc:mask="0x1" edc:name="FLT6R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT6R5" edc:desc="" edc:mask="0x1" edc:name="FLT6R5" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="FLT7R0" edc:desc="" edc:mask="0x1" edc:name="FLT7R0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R1" edc:desc="" edc:mask="0x1" edc:name="FLT7R1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R2" edc:desc="" edc:mask="0x1" edc:name="FLT7R2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R3" edc:desc="" edc:mask="0x1" edc:name="FLT7R3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R4" edc:desc="" edc:mask="0x1" edc:name="FLT7R4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FLT7R5" edc:desc="" edc:mask="0x1" edc:name="FLT7R5" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
